# 1
# 1 2           בהקפה זו אנחנו מדפיסים 1 2  כלומר אנחנו מדפיסים מ1 עד 2
# 1 2 3       בהקפה זו אנחנו מדפיסים 1 2 3 כלומר אנחנו מדפיסים מ1 עד 3
# ....          הקפה זו אנחנו מדפיסים4  1 2 3 כלומר אנחנו מדפיסים מ1 עד 4
#........    
# 1 2 3 ... 19 20 

# תרגיל עזר
i = 1
while i <= 20: # 1.....20
    ##########
    print(i)
    ##########
    i += 1      # i = i + 1 


i = 1
while i <= 20:
    # הייתי רוצה להדפיס פה את כל המספרים מ0 עד איי
    # print(all < i) עילאי אמר
    j = 1 
    while j <= i:   # i....j
        print(  j  , end = ' ')     # מוסיפים לפרינט בקשה להדפיס עם רווח ולא ירידת שורה
        j+=1
    print()         # כדי לרדת שורה 
    i += 1      # i = i + 1 
    




